app/controllers/v1/order_items_controller.rb

  def index
    return render json: {}, status: 401 if @current_user.role != 8
    subject = OrderItem.includes({order: [:venue, :user]}, :product)
    @order_items = params[:all] && params[:all] == 'true' ? subject.all : subject.all.limit(500)
    render json: @order_items, root: "data", meta: {size: subject.all.size }, each_serializer: OrderItemsSerializer, status: 200
---
SELECT `order_items`.* FROM `order_items`
SELECT `products`.* FROM `products`  WHERE `products`.`id` IN (4, 5, 7, 3, 13, 14, 15, 16, 17, 18, 20, 19, 23, 24, 9, 21, 22, 27, 28, 25, 26, 10, 12, 8, 31, 37, 36, 42, 43, 29, 30, 40, 39, 45, 51, 52, 53, 41, 54, 55, 56)
SELECT `users`.* FROM `users`  WHERE `users`.`id` IN (38, 31, 33, 39, 79, 0, 80, 81, 30, 83, 86, 89, 106)
SELECT `venues`.* FROM `venues`  WHERE `venues`.`id` IN (1, 3, 8, 9, 2, 10, 0, 12, 15, 33, 11, 13, 34, 35)
SELECT  `order_items`.* FROM `order_items`  LIMIT 1000
SELECT COUNT(*) FROM `order_items`