app/controllers/v1/sessions_controller.rb

  def create

    user = User.authenticate(params[:email], params[:password])
    if user
      if user.venue_id
        venue = Venue.find(user.venue_id)
        return render_unauthorized if venue.archived
      end
      user.token_expiration = DateTime.current.advance(months:1)
      user.save
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'admin@hiyah.com' LIMIT 1
UPDATE `users` SET `token_expiration` = '2015-08-08 21:36:25', `updated_at` = '2015-07-08 21:36:25' WHERE `users`.`id` = 35