app/controllers/v1/users_controller.rb

SELECT `users`.* FROM `users`  WHERE `users`.`archived` = 0
---
  def index
    users = if @current_user.venue_id then User.where(venue_id:@current_user.venue_id,archived:false) else User.where(archived:false) end
    if params[:role]
      users = users.where('role & ? > 0', params[:role])