app/controllers/v1/venues_controller.rb

  def index
    @venues = Venue.where(archived:false)
---
SELECT `venues`.* FROM `venues`  WHERE `venues`.`archived` = 0